run/tutorials/heatTransfer/chtMultiRegionFoam/reverseBurner/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0  0 -1) (1  0 -1) (2  0 -1) (10  0 -1) (11  0 -1) (21  0 -1) (22  0 -1)
    (0 10 -1) (1 10 -1) (2 10 -1) (10 10 -1) (11 10 -1) (21 10 -1) (22 10 -1)
    (0 40 -1) (1 40 -1) (2 40 -1) (10 40 -1) (11 40 -1) (21 40 -1) (22 40 -1)
    (0 50 -1) (1 50 -1) (2 50 -1) (10 50 -1) (11 50 -1) (21 50 -1) (22 50 -1)
    (0 51 -1) (1 51 -1) (2 51 -1) (10 51 -1) (11 51 -1) (21 51 -1) (22 51 -1)

    (0  0  1) (1  0  1) (2  0  1) (10  0  1) (11  0  1) (21  0  1) (22  0  1)
    (0 10  1) (1 10  1) (2 10  1) (10 10  1) (11 10  1) (21 10  1) (22 10  1)
    (0 40  1) (1 40  1) (2 40  1) (10 40  1) (11 40  1) (21 40  1) (22 40  1)
    (0 50  1) (1 50  1) (2 50  1) (10 50  1) (11 50  1) (21 50  1) (22 50  1)
    (0 51  1) (1 51  1) (2 51  1) (10 51  1) (11 51  1) (21 51  1) (22 51  1)
);

blocks
(
    hex ( 0  1  8  7 35 36 43 42) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex ( 1  2  9  8 36 37 44 43) solid ( 4  40 1) simpleGrading (1 1 1)
    hex ( 2  3 10  9 37 38 45 44) gas   (32  40 1) simpleGrading (1 1 1)
    hex ( 3  4 11 10 38 39 46 45) solid ( 4  40 1) simpleGrading (1 1 1)
    hex ( 4  5 12 11 39 40 47 46) gas   (40  40 1) simpleGrading (1 1 1)
    hex ( 5  6 13 12 40 41 48 47) solid ( 4  40 1) simpleGrading (1 1 1)

    hex ( 7  8 15 14 42 43 50 49) gas   ( 4 120 1) simpleGrading (1 1 1)
    hex ( 8  9 16 15 43 44 51 50) gas   ( 4 120 1) simpleGrading (1 1 1)
    hex ( 9 10 17 16 44 45 52 51) gas   (32 120 1) simpleGrading (1 1 1)
    hex (10 11 18 17 45 46 53 52) solid ( 4 120 1) simpleGrading (1 1 1)
    hex (11 12 19 18 46 47 54 53) gas   (40 120 1) simpleGrading (1 1 1)
    hex (12 13 20 19 47 48 55 54) solid ( 4 120 1) simpleGrading (1 1 1)

    hex (14 15 22 21 49 50 57 56) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex (15 16 23 22 50 51 58 57) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex (16 17 24 23 51 52 59 58) gas   (32  40 1) simpleGrading (1 1 1)
    hex (17 18 25 24 52 53 60 59) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex (18 19 26 25 53 54 61 60) gas   (40  40 1) simpleGrading (1 1 1)
    hex (19 20 27 26 54 55 62 61) solid ( 4  40 1) simpleGrading (1 1 1)

    hex (21 22 29 28 56 57 64 63) solid ( 4   4 1) simpleGrading (1 1 1)
    hex (22 23 30 29 57 58 65 64) solid ( 4   4 1) simpleGrading (1 1 1)
    hex (23 24 31 30 58 59 66 65) solid (32   4 1) simpleGrading (1 1 1)
    hex (24 25 32 31 59 60 67 66) solid ( 4   4 1) simpleGrading (1 1 1)
    hex (25 26 33 32 60 61 68 67) solid (40   4 1) simpleGrading (1 1 1)
    hex (26 27 34 33 61 62 69 68) solid ( 4   4 1) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    type empty;
    name frontAndBack;
}

boundary
(
    inletFuel
    {
        type patch;
        faces
        (
            (0 1 36 35)
        );
    }
    inletAir
    {
        type patch;
        faces
        (
            (2 3 38 37)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 40 39)
        );
    }
    axis
    {
        type symmetryPlane;
        faces
        (
            (0 7 42 35)
            (7 14 49 42)
            (14 21 56 49)
            (21 28 63 56)
        );
    }
    external
    {
        type patch;
        faces
        (
            (1 2 37 36)
            (3 4 39 38)
            (5 6 41 40)
            (6 13 48 41)
            (13 20 55 48)
            (20 27 62 55)
            (27 34 69 62)
            (28 29 64 63)
            (29 30 65 64)
            (30 31 66 65)
            (31 32 67 66)
            (32 33 68 67)
            (33 34 69 68)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
