run/tutorials/heatTransfer/chtMultiRegionFoam/reverseBurner/system/gas/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    ignition;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.01 0.1 -0.01) (0.02 0.11 0.01);
    }
);


// ************************************************************************* //
